"use strict";

Object.defineProperty(exports, "__esModule", {
  value: true
});
exports["default"] = void 0;
var sections = [{
  "id": "sec1",
  "imgSrc": require("../components/imgs/asprinprotect100.jpg"),
  "title": "ASPIRIN PROTECT 100mg",
  "payAttention": "المعلومات الواردة عن الدواء مبنية على النشرات الطبية للدواء، مع هذا فإنها لا تشكل بديلا عن استشارة الطبيب.",
  "content": {
    name: "اسبرين بروتيكت 100",
    formation: "\n      \u0623\u0633\u064A\u062A\u064A\u0644 \u0633\u0627\u0644\u064A\u0633\u064A\u0644\u0643 \u0623\u0633\u064A\u062F (\u0627\u0644\u0623\u0633\u0628\u0631\u064A\u0646) \u064A\u0646\u062A\u0645\u064A \u0625\u0644\u0649 \u0639\u0627\u0626\u0644\u0629 \u0645\u0636\u0627\u062F\u0627\u062A \u0627\u0644\u0627\u0644\u062A\u0647\u0627\u0628 \u063A\u064A\u0631 \u0627\u0644\u0633\u062A\u064A\u0631\u0648\u064A\u062F\u064A\u0629\u060C \u0627\u0644\u062A\u064A \u062A\u0639\u0645\u0644 \u0639\u0644\u0649 \u062A\u062B\u0628\u064A\u0637 \u0639\u0645\u0644 \u0625\u0646\u0632\u064A\u0645 \u064A\u0633\u0645\u0649 \u0625\u0646\u0632\u064A\u0645 \u0627\u0644\u0623\u0643\u0633\u062F\u0629 \u0627\u0644\u062D\u0644\u0642\u064A\u060C \u0627\u0644\u0645\u0633\u0624\u0648\u0644 \u0639\u0646 \u062A\u0635\u0646\u064A\u0639 \u0645\u0648\u0627\u062F \u0641\u064A \u0627\u0644\u062C\u0633\u0645 \u062A\u0633\u0628\u0628 \u0627\u0644\u0627\u0644\u062A\u0647\u0627\u0628 \u0648\u0627\u0644\u0623\u0644\u0645\u060C \u0648\u064A\u0645\u0646\u0639 \u062A\u0631\u0627\u0643\u0645 \u0627\u0644\u0635\u0641\u0627\u0626\u062D \u0627\u0644\u062F\u0645\u0648\u064A\u0629 \u0641\u064A \u0627\u0644\u062F\u0645 \u0645\u0645\u0627 \u064A\u0645\u0646\u0639 \u0639\u0645\u0644\u064A\u0629 \u0627\u0644\u062A\u062C\u0644\u0637.\n      ",
    aboutItem: "\u0627\u0646\u062A\u0634\u0631 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0627\u0644\u0623\u0633\u0628\u0631\u064A\u0646 \u0645\u0646\u0630 \u0623\u0643\u062B\u0631 \u0645\u0646 80 \u0639\u0627\u0645\u064B\u0627 \u0648\u0647\u0648 \u0645\u0636\u0627\u062F \u063A\u064A\u0631 \u0627\u0633\u062A\u0631\u0648\u064A\u062F\u064A \u0644\u0644\u0627\u0644\u062A\u0647\u0627\u0628 \u064A\u064F\u0633\u062A\u062E\u062F\u0645 \u0644\u062A\u0633\u0643\u064A\u0646 \u0627\u0644\u0622\u0644\u0627\u0645\u060C \u0648\u062E\u0641\u064A\u0636 \u062F\u0631\u062C\u0629 \u0627\u0644\u062D\u0631\u0627\u0631\u0629\u060C \u0648\u062A\u0642\u0644\u064A\u0644 \u0623\u0639\u0631\u0627\u0636 \u0627\u0644\u062A\u0647\u0627\u0628 \u0627\u0644\u0645\u0641\u0627\u0635\u0644\u060C \u0643\u0645\u0627 \u0623\u0646\u0647 \u064A\u064F\u0633\u0627\u0647\u0645 \u0625\u0630\u0627 \u0627\u064F\u0633\u062A\u062E\u062F\u0645 \u0628\u0643\u0645\u064A\u0629 \u0642\u0644\u064A\u0644\u0629 \u0628\u0645\u0646\u0639 \u062A\u0643\u0648\u0651\u064F\u0646 \u062E\u064E\u062B\u064E\u0631\u0627\u062A \u062F\u0645\u0648\u064A\u0629.\n      \u0647\u0646\u0627\u0643 \u0639\u062F\u0629 \u0627\u0633\u062A\u0639\u0645\u0627\u0644\u0627\u062A \u0644\u0644\u0623\u0633\u0628\u0631\u064A\u0646 \u0643\u062F\u0648\u0627\u0621 \u0644\u0639\u0644\u0627\u062C \u0627\u0644\u0631\u0634\u062D\u060C \u0648\u0622\u0644\u0627\u0645 \u0627\u0644\u062F\u0648\u0631\u0629 \u0627\u0644\u0634\u0647\u0631\u064A\u0629\u060C \u0648\u0622\u0644\u0627\u0645 \u0627\u0644\u0631\u0623\u0633 \u0648\u0643\u0630\u0644\u0643 \u0622\u0644\u0627\u0645 \u0627\u0644\u0639\u0636\u0644\u0627\u062A \u0648\u0627\u0644\u0645\u0641\u0627\u0635\u0644.\n      \u0625\u062D\u062F\u0649 \u0623\u0628\u0631\u0632 \u0627\u0644\u0622\u062B\u0627\u0631 \u0627\u0644\u062C\u0627\u0646\u0628\u064A\u0629 \u0644\u0644\u0623\u0633\u0628\u0631\u064A\u0646 \u0647\u064A \u062A\u0633\u0628\u0628\u0647 \u0628\u062A\u0647\u064A\u064A\u062C \u0627\u0644\u0645\u0639\u062F\u0629\u060C \u0648\u0628\u0627\u0644\u0646\u0632\u064A\u0641\u060C \u0643\u0645\u0627 \u0623\u0646\u0647 \u0645\u0646 \u0627\u0644\u0645\u0645\u0643\u0646 \u0623\u0646 \u064A\u064F\u0633\u0628\u0628 \u062F\u0627\u0621 \u0631\u0650\u064A\u0651\u0650\u064A (Reyes) \u0648\u0647\u0648 \u0645\u0631\u0636 \u0646\u0627\u062F\u0631 \u064A\u064F\u0635\u064A\u0628 \u0627\u0644\u062F\u0645\u0627\u063A \u0648\u0627\u0644\u0643\u0628\u062F \u0648\u064A\u0638\u0647\u0631 \u0628\u0634\u0643\u0644 \u0639\u0627\u0645 \u0644\u062F\u0649 \u0627\u0644\u0623\u0637\u0641\u0627\u0644.",
    pharmacistForm: "أقراص - أقراص مغلفة - كبسولات",
    doses: "أستشر الصيدلي",
    storage_preservation: "يجب حفظ الدواء في عبوة محكمة الإغلاق بعيدًا عن متناول أيدي الأطفال.",
    forgettingAdose: "يجب أخذ الجرعة المنسية عند تذكرها فورًا أما إذا كان موعد الجرعة التالية خلال ساعتين فيتم أخذ جرعة واحدة فورًا مع ترك الجرعة التالية.",
    overdose: "يجب التوجه فورًا لغرفة الطوارئ في أقرب مستشفى."
  },
  "warnings": {
    pregnancy: " \u064A\u062C\u0628 \u0627\u0633\u062A\u0634\u0627\u0631\u0629 \u0627\u0644\u0637\u0628\u064A\u0628 \u062D\u0648\u0644 \u0627\u0633\u062A\u062E\u062F\u0627\u0645\u0647 \u0625\u0630 \u064A\u064F\u0633\u062A\u062E\u062F\u0645 \u0627\u0644\u0623\u0633\u0628\u0631\u064A\u0646 \u0641\u064A \u0627\u0644\u062B\u0644\u062B \u0627\u0644\u0623\u0648\u0644 \u0648\u0627\u0644\u062B\u0627\u0646\u064A \u0628\u062D\u0630\u0631 \u0648\u0644\u0643\u0646 \u0644\u0627 \u064A\u064F\u0646\u0635\u062D \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u062F\u0648\u0627\u0621 \u0627\u0644\u0623\u0633\u0628\u0631\u064A\u0646 \u062E\u0644\u0627\u0644 \u0627\u0644\u062B\u0644\u062B \u0627\u0644\u062B\u0627\u0644\u062B \u0645\u0646 \u0627\u0644\u062D\u0645\u0644.\n      \u062F\u0631\u062C\u0629 \u0627\u0644\u062E\u0637\u0648\u0631\u0629: B.",
    breastfeeding: "\u064A\u0646\u062A\u0642\u0644 \u0627\u0644\u062F\u0648\u0627\u0621 \u0644\u062D\u0644\u064A\u0628 \u0627\u0644\u0623\u0645 \u0644\u0630\u0627 \u064A\u062C\u0628 \u0627\u0633\u062A\u0634\u0627\u0631\u0629 \u0627\u0644\u0637\u0628\u064A\u0628 \u0642\u0628\u0644 \u062A\u0646\u0627\u0648\u0644\u0647.\n      \u062F\u0631\u062C\u0629 \u0627\u0644\u062E\u0637\u0648\u0631\u0629: \u063A\u064A\u0631 \u0645\u064F\u062D\u062F\u062F\u0629.",
    babies: "لا يُنصح باستخدامه للأطفال دون عمر 12 عامًا.",
    eldery: "ليست هنالك مشكلات خاصة."
  },
  "price": 50,
  "category": "one"
}, {
  "id": "sec2",
  "imgSrc": "https://picsum.photos/id/2/720/480",
  "title": "منتج2",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "one"
}, {
  "id": "sec3",
  "imgSrc": "https://picsum.photos/id/3/720/480",
  "title": "منتج3",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "one"
}, {
  "id": "sec4",
  "imgSrc": "https://picsum.photos/id/4/720/480",
  "title": "منتج4",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "two"
}, {
  "id": "sec5",
  "imgSrc": "https://picsum.photos/id/5/720/480",
  "title": "منتج5",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "two"
}, {
  "id": "sec6",
  "imgSrc": "https://picsum.photos/id/6/720/480",
  "title": "منتج6",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "three"
}, {
  "id": "sec7",
  "imgSrc": "https://picsum.photos/id/7/720/480",
  "title": "منتج7",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "four"
}, {
  "id": "sec8",
  "imgSrc": "https://picsum.photos/id/8/720/480",
  "title": "منتج8",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "four"
}, {
  "id": "sec9",
  "imgSrc": "https://picsum.photos/id/9/720/480",
  "title": "منتج9",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "four"
}, {
  "id": "sec10",
  "imgSrc": "https://picsum.photos/id/10/720/480",
  "title": "منتج10",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "five"
}, {
  "id": "sec11",
  "imgSrc": "https://picsum.photos/id/11/720/480",
  "title": "منتج11",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "six"
}, {
  "id": "sec12",
  "imgSrc": "https://picsum.photos/id/12/720/480",
  "title": "منتج12",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "six"
}, {
  "id": "sec13",
  "imgSrc": "https://picsum.photos/id/13/720/480",
  "title": "منتج13",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "seven"
}, {
  "id": "sec14",
  "imgSrc": "https://picsum.photos/id/14/720/480",
  "title": "منتج14",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "eight"
}, {
  "id": "sec15",
  "imgSrc": "https://picsum.photos/id/15/720/480",
  "title": "منتج15",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "eight"
}, {
  "id": "sec16",
  "imgSrc": "https://picsum.photos/id/16/720/480",
  "title": "منتج16",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "eight"
}, {
  "id": "sec17",
  "imgSrc": "https://picsum.photos/id/17/720/480",
  "title": "منتج17",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "eight"
}, {
  "id": "sec18",
  "imgSrc": "https://picsum.photos/id/18/720/480",
  "title": "منتج18",
  "content": "شرح تفصيلي للمنتج",
  "price": 50,
  "category": "eight"
}];
var _default = sections;
exports["default"] = _default;
//# sourceMappingURL=sections.dev.js.map
